sphere_in_oil/constant/oil/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState icoPolynomial;
    specie          specie;
    energy          sensibleEnthalpy;
}


mixture
{
    // coefficients for DowThermA oil

    specie
    {
        molWeight       166.0;
    }
    equationOfState
    {
        rhoCoeffs<8>    ( 1.3632784512E+03 -1.3938506273E+00 1.7344173768E-03 -1.7393088213E-06 0 0 0 0 );
    // valid from 15C to 405C
    }
    thermodynamics
    {
        Hf              0;
        Sf              0;
        CpCoeffs<8>     ( 1.6665337809E+03 -6.4879359625E+00 3.4427492838E-02 -5.5134013220E-05 3.2242982175E-08 0 0 0 );
    
    // valid from 15C to 405C
    }
    transport
    {
	// valid from 15C to 405C

        muCoeffs<8>     ( 7.8938104591E-01 -9.4695754139E-03  4.7123657786E-05 -1.2421327939E-07 1.8270677458E-10 -1.4211773801E-13 4.5661764167E-17 0 );
        kappaCoeffs<8>  ( 1.8560400000E-01 -1.6000000000E-04 0 0 0 0 0 0 );
    }
}

// ************************************************************************* //
